; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	thermograph0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star5 - direction
	Star3 - direction
	Star2 - direction
	Star1 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation7)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation6)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation7)
	(calibration_target instrument10 Star5)
	(supports instrument11 thermograph0)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 GroundStation8)
	(supports instrument12 thermograph0)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 Star3)
	(calibration_target instrument12 GroundStation4)
	(calibration_target instrument12 Star5)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
	(supports instrument13 thermograph1)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 GroundStation6)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 GroundStation4)
	(calibration_target instrument14 GroundStation7)
	(calibration_target instrument14 GroundStation6)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation7)
	(supports instrument15 thermograph1)
	(supports instrument15 thermograph0)
	(calibration_target instrument15 Star1)
	(calibration_target instrument15 GroundStation8)
	(calibration_target instrument15 Star2)
	(supports instrument16 thermograph1)
	(supports instrument16 thermograph0)
	(calibration_target instrument16 GroundStation8)
	(supports instrument17 thermograph1)
	(calibration_target instrument17 GroundStation6)
	(calibration_target instrument17 GroundStation4)
	(calibration_target instrument17 GroundStation7)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation6)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Phenomenon10)
	(pointing satellite3 GroundStation7)
	(pointing satellite5 Star13)
	(pointing satellite6 Star3)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 thermograph1)
	(have_image Phenomenon14 thermograph1)
))

)

; plan
1. (turn_to satellite6 star3 groundstation6)
   deleted: (pointing satellite6 groundstation6)
   added: (pointing satellite6 star3)
   goals met: 1 of 11
2. (turn_to satellite5 star13 groundstation7)
   deleted: (pointing satellite5 groundstation7)
   added: (pointing satellite5 star13)
   goals met: 2 of 11
3. (turn_to satellite3 groundstation7 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation7)
   goals met: 3 of 11
4. (turn_to satellite1 groundstation4 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 11
5. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 11
6. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 3 of 11
7. (turn_to satellite1 phenomenon14 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 11
8. (take_image satellite1 phenomenon14 instrument1 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 4 of 11
9. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 11
10. (turn_to satellite0 groundstation0 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 11
11. (take_image satellite1 phenomenon12 instrument1 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 6 of 11
12. (turn_to satellite1 planet11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet11)
   goals met: 6 of 11
13. (take_image satellite1 planet11 instrument1 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 7 of 11
14. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 7 of 11
15. (take_image satellite1 star13 instrument1 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 8 of 11
16. (turn_to satellite1 star9 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star9)
   goals met: 8 of 11
17. (take_image satellite1 star9 instrument1 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 9 of 11
18. (turn_to satellite1 phenomenon10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon10)
   goals met: 10 of 11
19. (take_image satellite1 phenomenon10 instrument1 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 11 of 11
